Revit 2026 API
ElementTransformUtils.CopyElements Method
Overload List
Name | Description
CopyElements(Document, ICollection<ElementId>, XYZ)
CopyElements(Document, ICollection<ElementId>, Document, Transform, CopyPasteOptions)
CopyElements(View, ICollection<ElementId>, View, Transform, CopyPasteOptions)
Top
See Also
Reference
ElementTransformUtils Class
Autodesk.Revit.DB Namespace